Sample SOAP API CREATE

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:enterprise.soap.sforce.com" xmlns:urn1="urn:sobject.enterprise.soap.sforce.com">
   <soapenv:Header>
      
      <urn:SessionHeader>
         <urn:sessionId>00Dbm00000987n7!AQEAQEKjTdS.yoECnjFfnTAt3P0huYuXzSG4P4EUhA8H3ZnV6iR7V4SIUS_zH1qcTApveq8sJgBuldJAHjdod4Eas9noQWST</urn:sessionId>
      </urn:SessionHeader>
   </soapenv:Header>
   <soapenv:Body>
      <urn:create>
         <!--Zero or more repetitions:-->
         <urn:sObjects xsi:type="urn1:Account" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <!--Zero or more repetitions:-->
            <Description>It is better than Blackbeards.</Description>
            <Name>Bluebeards Coconut Milk House</Name>
         </urn:sObjects>
      </urn:create>
   </soapenv:Body>
</soapenv:Envelope>
