Notes/sampleDataFiles/salesForceSamples/core calls/create.xml

<?xml version="1.0" encoding="utf-8"?>
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:enterprise.soap.sforce.com" xmlns:urn1="urn:sobject.enterprise.soap.sforce.com" xmlns:ddd="http://www.w3.org/2001/XMLSchema-instance">
        <soapenv:Header>
            <urn:SessionHeader>
                <urn:sessionId>QwWsHJyTPW.1pd0_jXlNKOSU</urn:sessionId>
            </urn:SessionHeader>
        </soapenv:Header>
        <soapenv:Body>
            <urn:create>
                <urn:sObjects ddd:type="Contact">
                    <AccountId>001D000000HRzKD</AccountId>
                    <FirstName>Jane</FirstName>
                    <LastName>Doe</LastName>
                </urn:sObjects>
                <urn:sObjects ddd:type="ddda">
                    <Name>Acme Rockets, Inc.</Name>
                </urn:sObjects>
            </urn:create>
        </soapenv:Body>
    </soapenv:Envelope>